src/cf/src/Catalogs/СценарииОбработкиЗадач/СценарииОбработкиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СценарииОбработкиЗадач</name>
  <predefined>
    <items>
      <name>БазовыйСценарийЗадач</name>
      <description>Базовый сценарий задач</description>
    </items>
  </predefined>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыСостояний</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальноеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПереходыПоСостояниям</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПерехода</name>
      <type>
        <types>CatalogRef.СостоянияЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойПереход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/СостоянияЗадач/СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗадач</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаБизнесТестировании</name>
      <description>На бизнес-тестировании</description>
    </items>
    <items>
      <name>НаУточнении</name>
      <description>На уточнении</description>
    </items>
    <items>
      <name>НоваяЗадача</name>
      <description>Новая задача</description>
    </items>
    <items>
      <name>ОжиданиеПереносаИзменений</name>
      <description>Ожидание переноса изменений в продуктив</description>
    </items>
    <items>
      <name>ОтмененоВыполнение</name>
      <description>Отменено выполнение</description>
    </items>
    <items>
      <name>Приостановлена</name>
      <description>Приостановлена</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>ФормированиеТехническогоРешения</name>
      <description>Формирование тех. решения</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенСрокСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательнаПричинаИзмененияСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения100</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПриРасчетеВремениВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаСостояния</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьТекстЦвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/СценарииОбработкиЗадач/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Функция формирования данных для сценария по-умолчанию сценария
//
// Возвращаемое значение:
//   Структура:
//		* ЭтапыСостояний - ТаблицаЗначений:
//			** Состояние - СправочникСсылка.СостоянияЗадач
//			** НачальноеПоУмолчанию - Булево - Истина, если этап самый перый в сценарии
//		* ПереходыПоСостояниям - ТаблицаЗначений:
//			** Состояние - СправочникСсылка.СостоянияЗадач
//			** СостояниеПерехода - СправочникСсылка.СостоянияЗадач
//			** ОсновнойПереход - Булево - Истина, если является стандартным ходом сценария без отклонений
//
Функция СтруктураДанныхСценарияПоУмолчанию() Экспорт
	
	ЭтапыСостояний = Новый ТаблицаЗначений;
	ЭтапыСостояний.Колонки.Добавить("Состояние");
	ЭтапыСостояний.Колонки.Добавить("НачальноеПоУмолчанию");
	
	ПереходыПоСостояниям = Новый ТаблицаЗначений;
	ПереходыПоСостояниям.Колонки.Добавить("Состояние");
	ПереходыПоСостояниям.Колонки.Добавить("СостояниеПерехода");
	ПереходыПоСостояниям.Колонки.Добавить("ОсновнойПереход");
	
	// Заполнение всех этапов состояний.
	
	// 1
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.Зарегистрирована;
	НовСтрокаЭтапаСостояния.НачальноеПоУмолчанию = Истина;
	
	// 2
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.Согласование;
	
	// 3
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.ФормированиеТехническогоРешения;
	
	// 4
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.ВРаботе;
	
	// 5
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.НаБизнесТестировании;
	
	// 6
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.ОжиданиеПереносаИзменений;
	
	// 7
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.Выполнена;
	
	// 8
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.НаУточнении;
	
	// 9
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.Приостановлена;
	
	// 10
	НовСтрокаЭтапаСостояния = ЭтапыСостояний.Добавить();
	НовСтрокаЭтапаСостояния.Состояние = Справочники.СостоянияЗадач.ОтмененоВыполнение;
	
	// Заполнение "Переходы по состояниям".
	
	// Зарегистрирована
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.Зарегистрирована;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.ОсновнойПереход = Истина;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.Зарегистрирована;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.Согласование;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.Зарегистрирована;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.НаУточнении;
	
	// Согласование
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.Согласование;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.ОсновнойПереход = Истина;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.Согласование;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ФормированиеТехническогоРешения;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.Согласование;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.НаУточнении;
	
	// ФормированиеТехническогоРешения
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ФормированиеТехническогоРешения;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.ОсновнойПереход = Истина;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ФормированиеТехническогоРешения;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.Согласование;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ФормированиеТехническогоРешения;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.НаУточнении;
	
	// ВРаботе
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.Выполнена;
	НовСтрокаПерехода.ОсновнойПереход = Истина;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.НаБизнесТестировании;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.НаУточнении;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.Приостановлена;
	
	// НаБизнесТестировании
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.НаБизнесТестировании;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.ОсновнойПереход = Истина;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.НаБизнесТестировании;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.Выполнена;
	
	// ОжиданиеПереносаИзменений
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ОжиданиеПереносаИзменений;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.Выполнена;
	НовСтрокаПерехода.ОсновнойПереход = Истина;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ОжиданиеПереносаИзменений;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ВРаботе;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ОтмененоВыполнение;
	
	// Выполнена
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.Выполнена;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.ОсновнойПереход = Истина;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.Выполнена;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.Зарегистрирована;
	
	// НаУточнении
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.НаУточнении;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.ОсновнойПереход = Истина;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.НаУточнении;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.Зарегистрирована;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.НаУточнении;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.Согласование;
	
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.НаУточнении;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ФормированиеТехническогоРешения;
	
	// Приостановлена
	НовСтрокаПерехода = ПереходыПоСостояниям.Добавить();
	НовСтрокаПерехода.Состояние = Справочники.СостоянияЗадач.Приостановлена;
	НовСтрокаПерехода.СостояниеПерехода = Справочники.СостоянияЗадач.ВРаботе;
	НовСтрокаПерехода.ОсновнойПереход = Истина;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ЭтапыСостояний", ЭтапыСостояний);
	СтруктураРезультата.Вставить("ПереходыПоСостояниям", ПереходыПоСостояниям);
	
	Возврат СтруктураРезультата;

КонецФункции // СтруктураДанныхБазовогоСценария()

// Заполнение базовым сценарием обработки: Зарегистрирована, ВРаботе, Выполнена, НаУточнении, Приостановлена 
//
// Параметры:
//  СценарийСсылка - СправочникСсылка.СценарииОбработкиЗадач
//
Процедура ЗаполнитьБазовыйСценарийОбработки(СценарийСсылка) Экспорт
	
	ОбъектСценарий = СценарийСсылка.ПолучитьОбъект();
	ОбъектСценарий.Заблокировать();
	
	ОбъектСценарий.Комментарий = НСтр("ru = 'Заполнено базовым сценарием обработки'");
	
	ОбъектСценарий.ЭтапыСостояний.Очистить();
	ОбъектСценарий.ПереходыПоСостояниям.Очистить();
	
	ДанныеСценарияПоУмолчанию = Справочники.СценарииОбработкиЗадач.СтруктураДанныхСценарияПоУмолчанию();

	ОбъектСценарий.ЭтапыСостояний.Загрузить(ДанныеСценарияПоУмолчанию.ЭтапыСостояний);
	ОбъектСценарий.ПереходыПоСостояниям.Загрузить(ДанныеСценарияПоУмолчанию.ПереходыПоСостояниям);

	ОбъектСценарий.Записать();
	
КонецПроцедуры

// Функция возвращает массив состояний, которые являются переходам от состояния параметра.
// Первый элемент массива - это основное состояние перехода.
//
// Параметры:
//  Проект		 - СправочникСсылка.Проекты	 - Проект, за который завязан сценарий обработки
//  Состояние	 - СправочникСсылка.СостоянияЗадач - Базовый сценарий
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.СостоянияЗадач - список состояний переходов
//
Функция ПереходыСценарияПоСостоянию(Проект, Состояние) Экспорт
	
	Если Не ЗначениеЗаполнено(Проект) Или Не ЗначениеЗаполнено(Состояние) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	СценарийОбработки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект,"СценарийОбработкиЗадач");
	
	
	Если Не ЗначениеЗаполнено(СценарийОбработки) Тогда
		// Базовый сценарий в случае если основной не определен
		// ..позже: определять по иерархии проектов
		СценарийОбработки = Справочники.СценарииОбработкиЗадач.БазовыйСценарийЗадач;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СценарииОбработкиЗадачПереходыПоСостояниям.СостояниеПерехода КАК СостояниеПерехода,
	               |	СценарииОбработкиЗадачПереходыПоСостояниям.ОсновнойПереход КАК ОсновнойПереход
	               |ИЗ
	               |	Справочник.СценарииОбработкиЗадач.ПереходыПоСостояниям КАК СценарииОбработкиЗадачПереходыПоСостояниям
	               |ГДЕ
	               |	СценарииОбработкиЗадачПереходыПоСостояниям.Ссылка = &СценарийОбработки
	               |	И СценарииОбработкиЗадачПереходыПоСостояниям.Состояние = &Состояние
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОсновнойПереход УБЫВ";
	
	Запрос.УстановитьПараметр("СценарийОбработки", СценарийОбработки);
	Запрос.УстановитьПараметр("Состояние", Состояние);
	
	Результат = Запрос.Выполнить();
	ТаблицаДанных = Результат.Выгрузить();
	
	Возврат ТаблицаДанных.ВыгрузитьКолонку("СостояниеПерехода");

КонецФункции // ПереходыСценарияПоСостоянию()

#КонецОбласти

#КонецЕсли
